ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/usbd_task.c
/**
 ***************************************************************************
 * @addtogroup Tasks
 * @{
 * @file         usbd_task.c
 * @author       ADI
 * @version      V1.0.0
 * @date         16-May-2019
 * @brief        Source file contains comms task for wearable device framework.
 ***************************************************************************
 ***************************************************************************
 */
/*!
 *  \copyright Analog Devices
 * ****************************************************************************
 *
 * License Agreement
 *
 * Copyright (c) 2020 Analog Devices Inc.
 * All rights reserved.
 *
 * This source code is intended for the recipient only under the guidelines of
 * the non-disclosure agreement with Analog Devices Inc.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
 * CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
 * TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
 * SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
 * ****************************************************************************
 */

/*---------------------------- Includes --------------------------------------*/
#include <common_application_interface.h>
#include <includes.h>
#include <system_task.h>
#include <task_includes.h>
#include <usbd_task.h>
#ifdef HIBERNATE_MD_EN
#include <power_manager.h>
#endif

#include "app_timer.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "nordic_common.h"
#include "nrf.h"

#include "nrf_delay.h"
#include "nrf_drv_clock.h"
#include "nrf_drv_power.h"
#include "nrf_drv_usbd.h"
#include "nrf_gpio.h"
#include "nrf_log.h"

#include "app_error.h"
#include "app_usbd.h"
#include "app_usbd_cdc_acm.h"
#include "app_usbd_core.h"
#include "app_usbd_serial_num.h"
#include "app_usbd_string_desc.h"

#include "app_util.h"
#include <adi_osal.h>
#include <app_cfg.h>
#include <hw_if_config.h>
#include <post_office.h>
#include <task_includes.h>

#include "ble_nus.h"
#include "sdk_config.h"

#include "ad7156_dcfg.h"
#include "adpd4000_dcfg.h"
#include <tempr_lcfg.h>
#include "adxl_dcfg.h"
#include "dcb_general_block.h"
#include "lt_app_lcfg_block.h"
#ifdef USER0_CONFIG_APP
#include "dcb_user0_block.h"
#endif
#ifdef CUST4_SM
#include "adp5360.h"
#endif
#include "mw_ppg.h"
#include "semphr.h"
#include "task.h"
#include "us_tick.h"
#include "rtc.h"
#include "fds_drv.h"
#include <FreeRTOS.h>

/*------------------------ Private Function Prototype -----------------------*/
static void usbd_tx_task(void *pArgument);
static void usbd_application_task(void *pArgument);
static void cdc_acm_user_ev_handler(
    app_usbd_class_inst_t const *p_inst, app_usbd_cdc_acm_user_event_t event);

uint8_t get_file_download_chunk_count();

/*------------------------ Public Function Prototype -----------------------*/
#ifdef ENABLE_ECG_APP
extern bool ecg_update_dcb_present_flag(void);
#endif
#ifdef ENABLE_EDA_APP
extern bool eda_update_dcb_present_flag(void);
#endif
#ifdef ENABLE_BIA_APP
extern bool bia_update_dcb_present_flag(void);
#endif
#ifdef ENABLE_TEMP_DEBUG_STREAM
extern uint32_t g_temp_debugInfo[];
extern uint32_t batt_app_packet_count;
extern uint32_t usb_pend_start_time;
extern uint32_t usb_delay_time;
extern void packetize_temp_debug_data(void);
#endif
/* enum to hold possible PHY for wired communication */
typedef enum {
  M2M2_PHY_INVALID,
  M2M2_PHY_LOCAL,
  M2M2_PHY_UART,
  M2M2_PHY_SPI,
  M2M2_PHY_USB,
  M2M2_PHY_BLE,
} M2M2_PHY_ENUM_t;

/* If an application is not found in the routing table, this default PHY is
 * used. */
#define M2M2_PHY_DEFAULT M2M2_PHY_USB

/**
 * @brief:  The data structure used to define routing table entry in the Post
 * Office.
 */
typedef struct _usbd_routing_table_entry {
  M2M2_ADDR_ENUM_t address;
  M2M2_PHY_ENUM_t phy;
} usbd_routing_table_entry;

// TODO: Should we keep it?
const usbd_routing_table_entry usbd_routing_table[] = {
    {M2M2_ADDR_UNDEFINED, M2M2_PHY_INVALID},
    {M2M2_ADDR_EXTERNAL, M2M2_PHY_USB},
    {M2M2_ADDR_APP_CLI, M2M2_PHY_USB},
    {M2M2_ADDR_APP_WT, M2M2_PHY_USB},
    {M2M2_ADDR_APP_DROID, M2M2_PHY_BLE},
    {M2M2_ADDR_APP_IOS, M2M2_PHY_BLE},
};
#define USBD_ROUTING_TABLE_SIZE                                                \
  (sizeof(usbd_routing_table) / sizeof(usbd_routing_table[0]))

#ifdef COLLISION_DEBUG
uint32_t gPingRespCnt = 0, gPingReqCnt = 0;
#endif // COLLISION_DEBUG

/* For USBD Tx FreeRTOS Task Creation */
/* Create the stack for task */
uint8_t ga_usbd_tx_task_stack[APP_OS_CFG_USBD_TX_TASK_STK_SIZE];
/* Create handler for task */
ADI_OSAL_THREAD_HANDLE gh_usbd_tx_task_handler;
/* Create task attributes variable */
ADI_OSAL_STATIC_THREAD_ATTR g_usbd_tx_task_attributes;
/* Create TCB for task */
StaticTask_t g_usbd_tx_task_tcb;
/* Create Queue Handler for task */
ADI_OSAL_QUEUE_HANDLE gh_usbd_tx_task_msg_queue = NULL;
// Create semaphores
static ADI_OSAL_SEM_HANDLE g_usbd_tx_task_evt_sem;


/* For USBD app FreeRTOS Task Creation */
/* Create the stack for task */
uint8_t ga_usbd_app_task_stack[APP_OS_CFG_USBD_APP_TASK_STK_SIZE];
/* Create handler for task */
ADI_OSAL_THREAD_HANDLE gh_usbd_app_task_handler;
/* Create task attributes variable */
ADI_OSAL_STATIC_THREAD_ATTR g_usbd_app_task_attributes;
/* Create TCB for task */
StaticTask_t g_usbd_app_task_tcb;

/**
 * The maximum delay inside the USB task to wait for an event.
 */
#define USB_THREAD_MAX_BLOCK_TIME portMAX_DELAY

/* Mutex to protect app_usbd_cdc_acm_write/read apis */
ADI_OSAL_MUTEX_HANDLE g_usb_transfer_lock;
/* Semaphore to block until app_usbd_cdc_acm_write is done &
 * APP_USBD_CDC_ACM_USER_EVT_TX_DONE received */
ADI_OSAL_SEM_HANDLE g_usb_wr_sync;

#define CDC_ACM_COMM_INTERFACE 1
#define CDC_ACM_COMM_EPIN NRF_DRV_USBD_EPIN2

