ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/usbd_task.c
#define CDC_ACM_DATA_INTERFACE 2
#define CDC_ACM_DATA_EPIN NRF_DRV_USBD_EPIN1
#define CDC_ACM_DATA_EPOUT NRF_DRV_USBD_EPOUT1

/** @brief CDC_ACM class instance. */
APP_USBD_CDC_ACM_GLOBAL_DEF(m_app_cdc_acm, cdc_acm_user_ev_handler,
    CDC_ACM_COMM_INTERFACE, CDC_ACM_DATA_INTERFACE, CDC_ACM_COMM_EPIN,
    CDC_ACM_DATA_EPIN, CDC_ACM_DATA_EPOUT, APP_USBD_CDC_COMM_PROTOCOL_AT_V250);

/* enum to hold current status of USB connection in gb_usb_status variable */
enum {
  USB_DISCONNECTED = 0x00, /* disconnected from Host */
  USB_CONNECTED = 0x01,    /* connected to Host */
  USB_PORT_OPENED = 0x02,  /* USB port opened */
  USB_PORT_CLOSED = 0x03,  /* USB port closed */
};
/* Variable holding current USB connection status */
static volatile uint8_t gb_usb_status = USB_DISCONNECTED;
/* Variable to initiate stream stop from all sensors when USB connection
 * status is either USB_DISCONNECTED or USB_PORT_CLOSED */
static volatile bool gb_force_stream_stop = false;
/* Variable to hold the current status of USB tx: done or not; to be used by
 * FS task for log download decisions */
static volatile uint8_t g_usb_tx_pending_flag = 0;
/* To hold the USB connect src address(CLI/WT,etc) */
M2M2_ADDR_ENUM_t usb_pkt_src = M2M2_ADDR_UNDEFINED;
/* Flag to indicate usb powered event */
volatile bool g_usb_power_detected_flag = false;

extern volatile uint32_t  g_lt_task_timeout;
#ifdef LOW_TOUCH_FEATURE
extern ADI_OSAL_SEM_HANDLE   lt_task_evt_sem;
extern uint8_t gLowTouchRunning;
#endif
#ifdef USER0_CONFIG_APP
extern ADI_OSAL_SEM_HANDLE   user0_config_app_evt_sem;
#endif
extern ADI_OSAL_SEM_HANDLE   adpd4000_task_evt_sem;
extern ADI_OSAL_SEM_HANDLE   adxl_task_evt_sem;
#ifdef ENABLE_BIA_APP
extern ADI_OSAL_SEM_HANDLE   bia_task_evt_sem;
#endif
#ifdef ENABLE_ECG_APP
extern ADI_OSAL_SEM_HANDLE   ecg_task_evt_sem;
#endif
#ifdef ENABLE_EDA_APP
extern ADI_OSAL_SEM_HANDLE   eda_task_evt_sem;
#endif
#ifdef ENABLE_PPG_APP
extern ADI_OSAL_SEM_HANDLE   ppg_application_task_evt_sem;
#endif
#ifdef USE_FS
extern ADI_OSAL_SEM_HANDLE   fs_task_evt_sem;
#endif
/*!
 ****************************************************************************
 * @brief  Function to do FDS init adn RTC init
 * @param  None
 * @return None
 *****************************************************************************/
void fds_rtc_init(void)
{
    ret_code_t rc;
    rc = adi_fds_init();//must after ble init.
    if(NRF_SUCCESS != rc)
    {
        NRF_LOG_INFO("adi_fds_init fail");
        APP_ERROR_CHECK(rc);
    }
    rtc_init();
    //nrf_delay_ms(500);
}

/*!
 ****************************************************************************
 * @brief  Function to send PO pkts to USB transmit task
 * @param  p_pkt m2m2 packet to be send to USB Tx task
 * @return None
 *****************************************************************************/
void send_message_usbd_tx_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(gh_usbd_tx_task_msg_queue, p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  adi_osal_SemPost(g_usbd_tx_task_evt_sem);
}

/*!
 ****************************************************************************
 * @brief USB Tx task, USBD app init function.
 *****************************************************************************/
void usbd_task_init(void) {
  ADI_OSAL_STATUS eOsStatus;

  /* Create USBD tx thread */
  g_usbd_tx_task_attributes.pThreadFunc = usbd_tx_task;
  g_usbd_tx_task_attributes.nPriority = APP_OS_CFG_USBD_TX_TASK_PRIO;
  g_usbd_tx_task_attributes.pStackBase = &ga_usbd_tx_task_stack[0];
  g_usbd_tx_task_attributes.nStackSize = APP_OS_CFG_USBD_TX_TASK_STK_SIZE;
  g_usbd_tx_task_attributes.pTaskAttrParam = NULL;
  /* Thread Name should be of max 10 Characters */
  g_usbd_tx_task_attributes.szThreadName = "TX_USBD";
  g_usbd_tx_task_attributes.pThreadTcb = &g_usbd_tx_task_tcb;
  /* TODO: The Queue ptr holding size increased as 250 from 25
     in-order to get all sterams. The count can be decreased based on the
     calculations*/
  eOsStatus = adi_osal_MsgQueueCreate(&gh_usbd_tx_task_msg_queue, NULL, 250);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  } else {
    update_task_queue_list(
        APP_OS_CFG_USBD_TX_TASK_INDEX, gh_usbd_tx_task_msg_queue);
  }
  eOsStatus = adi_osal_ThreadCreateStatic(
      &gh_usbd_tx_task_handler, &g_usbd_tx_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }

  /* Create usbd application thread */
  app_usbd_serial_num_generate();

  g_usbd_app_task_attributes.pThreadFunc = usbd_application_task;
  g_usbd_app_task_attributes.nPriority = APP_OS_CFG_USBD_APP_TASK_PRIO;
  g_usbd_app_task_attributes.pStackBase = &ga_usbd_app_task_stack[0];
  g_usbd_app_task_attributes.nStackSize = APP_OS_CFG_USBD_APP_TASK_STK_SIZE;
  g_usbd_app_task_attributes.pTaskAttrParam = NULL;
  /* Thread Name should be of max 10 Characters */
  g_usbd_app_task_attributes.szThreadName = "USBD_Task";
  g_usbd_app_task_attributes.pThreadTcb = &g_usbd_app_task_tcb;

  eOsStatus = adi_osal_ThreadCreateStatic(
      &gh_usbd_app_task_handler, &g_usbd_app_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }

  eOsStatus = adi_osal_MutexCreate(&g_usb_transfer_lock);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }

  eOsStatus = adi_osal_SemCreate(&g_usb_wr_sync, 0U);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }

  eOsStatus = adi_osal_SemCreate(&g_usbd_tx_task_evt_sem, 0);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }
}

/*!
 ****************************************************************************
 * @brief Function to get the PHY corresponding to m2m2 addr, from USBD routing
 * table
 ******************************************************************************/
static M2M2_PHY_ENUM_t get_usbd_routing_table_entry(M2M2_ADDR_ENUM_t addr) {
  for (int i = 0; i < USBD_ROUTING_TABLE_SIZE; i++) {
    if (usbd_routing_table[i].address == addr) {
      return usbd_routing_table[i].phy;
    }
  }
  return M2M2_PHY_DEFAULT;
}

/*!
 ****************************************************************************
 * @brief Function to get g_usb_tx_pending_flag flag status - to know whether
 * USBD Tx done or not
 ******************************************************************************/
uint8_t get_usbd_tx_pending_status(void) { return (g_usb_tx_pending_flag); }
uint32_t total_rx_cnt = 0;

/*< Variable to hold FS log chunk pkt transferred via USB Tx, for log download
 */
volatile uint8_t gFsDownloadChunkCnt = 0;
/*< Variable to identify if USB Tx is doing FS log download */
volatile uint8_t gFsDownloadFlag = 0;
/*< Variable to hold the total pkt transferred via USB Tx, for log download */
uint8_t total_packet_cnt_transferred = 0;

/*!
 ****************************************************************************
 * @brief Function to control gFsDownloadFlag flag from FS task
 ******************************************************************************/
uint8_t setFsDownloadFlag(uint8_t flag) {
  gFsDownloadFlag = flag;
  if (!flag)
    gFsDownloadChunkCnt = 0;
  return 0;
}


uint8_t get_file_download_chunk_count()
{
 return(gFsDownloadChunkCnt);
}

/**
  * @brief  USBD tx task - control trasmission through USB peripheral
  * @param  pArgument not used
  * @return None
  */
#ifdef PROFILE_TIME_ENABLED
uint32_t usb_cdc_end_time, usb_avg_cdc_write_time,usb_cdc_start_time;
uint32_t usb_min_cdc_time,usb_max_cdc_time;
uint32_t usb_min_tx_time,usb_max_tx_time;
uint32_t usb_tx_time_end, usb_avg_tx_time,usb_tx_time_start;
uint32_t max_num_of_retries;
#endif

uint32_t num_bytes_transferred=0;
uint8_t num_retry=0;
uint8_t usb_cdc_write_failed=0;

