ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/usbd_task.c
#ifdef DCB
/*!
 ****************************************************************************
 * @brief Funtion to update the status of all DCB blocks if present/not
 *
 * @details This function is called after FDS init on bootup, to update DCB
 * present flags, based on what DCB blocks are present/absent Later the flags
 * will be updated on every DCB write/erase
 *
 * @param None
 ******************************************************************************/
void dcb_block_status_update() {
#ifdef LOW_TOUCH_FEATURE
  gen_blk_update_dcb_present_flag();
  lt_app_lcfg_update_dcb_present_flag();
#endif
  adpd4000_update_dcb_present_flag();
#ifdef ENABLE_TEMPERATURE_APP
  tempr_update_dcb_present_flag();
#endif
  adxl_update_dcb_present_flag();
#ifdef ENABLE_PPG_APP
  ppg_update_dcb_present_flag();
#endif
#ifdef ENABLE_ECG_APP
  ecg_update_dcb_present_flag();
#endif
#ifdef ENABLE_EDA_APP
  eda_update_dcb_present_flag();
#endif
#ifdef ENABLE_BIA_APP
  bia_update_dcb_present_flag();
#endif
  ad7156_update_dcb_present_flag();
#ifdef USER0_CONFIG_APP
  user0_blk_update_dcb_present_flag();
#endif
}
#endif

#ifdef CUST4_SM
/*!
 ****************************************************************************
 * @brief  Get status of watch:whether disconnected or connected to the Cradle
 * @param  None
 * @return USB_DISCONNECTED -> watch disconnected from cradle
 *         USB_CONNECTED    -> watch connected to cradle
 ******************************************************************************/
USBD_CONN_STATUS_t usbd_get_cradle_disconnection_status()
{
  /*if(gb_usb_status == USB_DISCONNECTED)
    return USBD_DISCONNECTED;
  else
    return USBD_CONNECTED;*/
  if(0 == Adp5360_pgood_pin_status_get())
  {
      return USBD_CONNECTED;
  }
  else
    return USBD_DISCONNECTED;
}
#endif

/*!
 ****************************************************************************
 * @brief  Reset the msg queue of USBD tx transmit task
 * @param  None
 * @return None
 ******************************************************************************/
void usbd_tx_msg_queue_reset()
{
  xQueueReset( gh_usbd_tx_task_msg_queue );
}

/* Debug variable to count total USB Tx pkts transferred */
static uint32_t gn_num_pkt_submit_cnt = 0;
/*< 'ind' variable to track how many times app_usbd_cdc_acm_write() api was
 * called for retry on failure */
uint8_t ind = 0;
/*< 'write_retry_cnt' variable to hold max retries allowed when
 * app_usbd_cdc_acm_write() api failes */
uint8_t write_retry_cnt = 6;

uint8_t usb_success = 0;
uint32_t submission_success_cnt = 0;
uint32_t interrupt_success_cnt = 0;
#ifdef PROFILE_TIME_ENABLED
uint32_t usb_cdc_end_time, usb_avg_cdc_write_time, usb_cdc_start_time;
uint32_t usb_min_cdc_time, usb_max_cdc_time;
uint32_t usb_min_tx_time, usb_max_tx_time;
uint32_t usb_tx_time_end, usb_avg_tx_time, usb_tx_time_start;
uint32_t num_bytes_transferred;
uint32_t max_num_of_retries;
#endif
/*!
 ****************************************************************************
 * @brief  USBD transmit task - handle post office messages and control
 * trasmission through USB peripheral
 * @param  pArgument not used
 * @return None
 ******************************************************************************/
static void usbd_tx_task(void *pArgument) {
  m2m2_hdr_t *pkt;
  M2M2_ADDR_ENUM_t  source; 
  M2M2_ADDR_ENUM_t destination;
  static uint8_t usbd_tx_buf[2064];
  uint32_t msg_len;
  ADI_OSAL_STATUS eOsStatus;

  /* Doing FDS init and All DCB Block status update from FreeRTOS task context
   Doing it from USB Tx task, since it has highest priority */
  fds_rtc_init();
#ifdef DCB
  dcb_block_status_update();
#endif

  /*
   FDS garbage collection has a delay, hence all tasks need
   to wait for it to complete, before FDS can be accessed.
   Intimate all tasks to continue with SemPend
  */
#ifdef LOW_TOUCH_FEATURE
  adi_osal_SemPost(lt_task_evt_sem);
#endif
#ifdef USER0_CONFIG_APP
  adi_osal_SemPost(user0_config_app_evt_sem);
#endif
  adi_osal_SemPost(adpd4000_task_evt_sem);
  adi_osal_SemPost(adxl_task_evt_sem);
#ifdef ENABLE_BIA_APP
  adi_osal_SemPost(bia_task_evt_sem);
#endif
#ifdef ENABLE_ECG_APP
  adi_osal_SemPost(ecg_task_evt_sem);
#endif
#ifdef ENABLE_EDA_APP
  adi_osal_SemPost(eda_task_evt_sem);
#endif
#ifdef ENABLE_PPG_APP
  adi_osal_SemPost(ppg_application_task_evt_sem);
#endif
#ifdef USE_FS
  adi_osal_SemPost(fs_task_evt_sem);
#endif

  while (1) {
    adi_osal_SemPend(g_usbd_tx_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    pkt = post_office_get(
        ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_USBD_TX_TASK_INDEX);
    if (gb_usb_status == USB_PORT_OPENED) {
#ifdef ENABLE_TEMP_DEBUG_STREAM 
      usb_delay_time &= ~(1 << 2);
#endif
      if (pkt == NULL) {
        continue;
      } else {
        msg_len = pkt->length;
        source = pkt->src;
        destination = pkt->dest;

        switch (get_usbd_routing_table_entry(destination)) {
        case M2M2_PHY_USB: {
#ifdef COLLISION_DEBUG
             if((pkt->dest == M2M2_ADDR_APP_CLI) && (pkt->length == 14))
                 gPingRespCnt++;
#endif //COLLISION_DEBUG
             pkt->src = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(pkt->src);
             pkt->dest = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(pkt->dest);
             pkt->length = BYTE_SWAP_16(pkt->length);
             pkt->checksum = BYTE_SWAP_16(pkt->checksum);
             memcpy(usbd_tx_buf,(uint8_t *)pkt,msg_len);
             gn_num_pkt_submit_cnt++;

             // Swap the header around so that the length can be properly freed.
             pkt->length = BYTE_SWAP_16(pkt->length);
#ifdef ENABLE_TEMP_DEBUG_STREAM                
                if((pkt->length == 18) && (pkt->src == 0x91C6)){
                    batt_app_packet_count &= ~(1 << 1);
                  }
#endif
             post_office_consume_msg(pkt);// consume packet as it copied to usbd_tx_buf buffer 

             g_usb_tx_pending_flag = 1;
             if(gFsDownloadFlag)
             {
                gFsDownloadChunkCnt++;
                total_packet_cnt_transferred++;
             }
             ind =0;
             ret_code_t ret = NRF_SUCCESS;
             num_retry = 0;
             do{
               eOsStatus = adi_osal_MutexPend(g_usb_transfer_lock, ADI_OSAL_TIMEOUT_FOREVER);
               if (eOsStatus != ADI_OSAL_SUCCESS)
               {
                  Debug_Handler();
               }
               usb_success = 0;
               NRF_LOG_INFO("transaction status before call= %d",usb_success);
#if PROFILE_TIME_ENABLED
               usb_cdc_start_time = get_micro_sec();
#endif
              ret = app_usbd_cdc_acm_write(&m_app_cdc_acm,usbd_tx_buf,msg_len);

