ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/usbd_task.c
              /* increment bytes transferred only for fs stream packet */
              if(source == M2M2_ADDR_SYS_FS_STREAM){
                if(num_retry == 0){
                  num_bytes_transferred += msg_len;
                  num_retry = 1;
                }
              }
              eOsStatus = adi_osal_MutexPost(g_usb_transfer_lock);
              if (eOsStatus != ADI_OSAL_SUCCESS)
              {
                Debug_Handler();
              }
              if(ret != NRF_SUCCESS)
              {
                NRF_LOG_INFO("CDC ACM unavailable, data received: %s", usbd_tx_buf);
#ifdef ENABLE_TEMP_DEBUG_STREAM 
                usb_delay_time |= (1 << 0);
                g_temp_debugInfo[1]  = usb_delay_time;
                packetize_temp_debug_data();
#endif
                MCU_HAL_Delay(4);   /*TODO: need to check why the usb busy comes*/
              }
              else
              {
#ifdef ENABLE_TEMP_DEBUG_STREAM 
                usb_delay_time &= ~(1 << 0);
#endif
                submission_success_cnt += 1;
                NRF_LOG_INFO("Successfull submission cnt= %d",submission_success_cnt);
#if PROFILE_TIME_ENABLED
                usb_cdc_end_time = get_micro_sec();
                usb_avg_cdc_write_time += (usb_cdc_end_time - usb_cdc_start_time);

                if ((usb_cdc_end_time - usb_cdc_start_time) < usb_min_cdc_time)
                  usb_min_cdc_time = (usb_cdc_end_time - usb_cdc_start_time);

                if ((usb_cdc_end_time - usb_cdc_start_time) > usb_max_cdc_time)
                  usb_max_cdc_time = (usb_cdc_end_time - usb_cdc_start_time);

                usb_tx_time_start = get_micro_sec();
#endif
              /* Block until transfer is completed */
#ifdef ENABLE_TEMP_DEBUG_STREAM  
              usb_pend_start_time = get_sensor_time_stamp() % MAX_RTC_TICKS_FOR_24_HOUR;
              usb_delay_time |= (1 << 1);
#endif
              eOsStatus = adi_osal_SemPend(g_usb_wr_sync, ADI_OSAL_TIMEOUT_FOREVER);
              if (eOsStatus != ADI_OSAL_SUCCESS) {
                Debug_Handler();
              }
#ifdef ENABLE_TEMP_DEBUG_STREAM  
              usb_delay_time &= ~(1 << 1);
#endif
#if PROFILE_TIME_ENABLED
              usb_tx_time_end = get_micro_sec();
              usb_avg_tx_time += (usb_tx_time_end - usb_tx_time_start);

              if ((usb_tx_time_end - usb_tx_time_start) < usb_min_tx_time)
                usb_min_tx_time = (usb_tx_time_end - usb_tx_time_start);

              if ((usb_tx_time_end - usb_tx_time_start) > usb_max_tx_time)
                usb_max_tx_time = (usb_tx_time_end - usb_tx_time_start);
#endif
              usb_success = 1;
              NRF_LOG_INFO("transaction status after call = %d", usb_success);
            }
            ind++;
#ifdef PROFILE_TIME_ENABLED
               if(ind > max_num_of_retries)
                max_num_of_retries = ind;
#endif
               }while((ind < write_retry_cnt) && (ret != NRF_SUCCESS));
                if(ret != NRF_SUCCESS){
                  usb_cdc_write_failed=1;
                }          
                break;
         }
          default: {
          /* Something went horribly wrong, swallow the packet and carry on. */
          post_office_consume_msg(pkt);
          break;
         }
       }
     }
    }
    else if ((gb_usb_status == USB_PORT_CLOSED) ||
               (gb_usb_status == USB_DISCONNECTED)) {

      if (gb_force_stream_stop) {
#ifdef ENABLE_TEMP_DEBUG_STREAM 
        usb_delay_time |= (1 << 2);
        g_temp_debugInfo[1]  = usb_delay_time;
        packetize_temp_debug_data();
#endif
        usbd_tx_msg_queue_reset();//TODO: we can read the message from queue and return it to pool
        /* Force-stop Sensor streaming that wasn't stopped */
        m2m2_hdr_t *req_pkt = NULL;
        ADI_OSAL_STATUS err;

        req_pkt = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_pm_force_stream_stop_cmd_t));
        if (req_pkt != NULL) {

          m2m2_pm_force_stream_stop_cmd_t *force_stream_stop_req =
              (m2m2_pm_force_stream_stop_cmd_t *)&req_pkt->data[0];

          /* send REQ packet */
          req_pkt->src = usb_pkt_src;
          req_pkt->dest = M2M2_ADDR_SYS_PM;

          force_stream_stop_req->command =
              M2M2_PM_SYS_COMMAND_FORCE_STREAM_STOP_REQ;
          NRF_LOG_INFO("Sending Force stream stop cmd from USB");
          post_office_send(req_pkt, &err);
          gb_force_stream_stop = false;
          usb_pkt_src = M2M2_ADDR_UNDEFINED;
        }
      }
      if(pkt != NULL)
        post_office_consume_msg(pkt);
    }
  }
}

static m2m2_hdr_t *gp_pkt_hdr;
#ifdef USE_USB_READ
static bool nRxLengthFlag = 0;
static uint16_t nRxLength = 8;
#endif //#USE_USB_READ
/*!
 ****************************************************************************
 * @brief User event handler @ref app_usbd_cdc_acm_user_ev_handler_t
 ******************************************************************************/
static void cdc_acm_user_ev_handler(
    app_usbd_class_inst_t const *p_inst, app_usbd_cdc_acm_user_event_t event) {
  static uint8_t m_cdc_data_array[BLE_NUS_MAX_DATA_LEN];
  app_usbd_cdc_acm_t const *p_cdc_acm = app_usbd_cdc_acm_class_get(p_inst);
  ADI_OSAL_STATUS eOsStatus;
  static uint16_t pkt_len = 0;
  static uint8_t pkt_complete = 1;

  switch (event) {
  case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN: {
    gb_usb_status = USB_PORT_OPENED;
    gb_force_stream_stop = false;
    adi_osal_SemPost(g_usbd_tx_task_evt_sem);
    /* Set up the first transfer */
#ifdef USE_USB_READ
    if (!nRxLengthFlag) {
      /* Read the packet header */
      nRxLengthFlag = 1;
      nRxLength = 8;
      eOsStatus =
          adi_osal_MutexPend(g_usb_transfer_lock, ADI_OSAL_TIMEOUT_FOREVER);
      if (eOsStatus != ADI_OSAL_SUCCESS) {
        Debug_Handler();
      }
      app_usbd_cdc_acm_read(&m_app_cdc_acm, (m_cdc_data_array), nRxLength);
      eOsStatus = adi_osal_MutexPost(g_usb_transfer_lock);
      if (eOsStatus != ADI_OSAL_SUCCESS) {
        Debug_Handler();
      }
    }
    NRF_LOG_INFO("CDC ACM port opened");
#endif // Use app_usbd_cdc_acm_read API
#if USE_USB_READ_ANY
    eOsStatus =
        adi_osal_MutexPend(g_usb_transfer_lock, ADI_OSAL_TIMEOUT_FOREVER);
    if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
    }
    app_usbd_cdc_acm_read_any(
        &m_app_cdc_acm, (m_cdc_data_array), BLE_NUS_MAX_DATA_LEN);
    pkt_complete = 1;
    pkt_len = 0;
    eOsStatus = adi_osal_MutexPost(g_usb_transfer_lock);
    if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
    }
#endif // Use app_usbd_cdc_acm_read_any API
    break;
  }

