ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/usbd_task.c
  case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE:
    NRF_LOG_INFO("CDC ACM port closed");
    gb_usb_status = USB_PORT_CLOSED;
    gb_force_stream_stop = true;
    adi_osal_SemPost(g_usbd_tx_task_evt_sem);
    break;

  case APP_USBD_CDC_ACM_USER_EVT_TX_DONE:
    interrupt_success_cnt += 1;
    NRF_LOG_INFO("ISR count = %d", interrupt_success_cnt);
    g_usb_tx_pending_flag = 0;
    eOsStatus = adi_osal_SemPost(g_usb_wr_sync);
    if (eOsStatus != ADI_OSAL_SUCCESS)
      Debug_Handler();
    break;

  case APP_USBD_CDC_ACM_USER_EVT_RX_DONE: {
#ifdef USE_USB_READ
    ret_code_t ret;
    static uint16_t index = 8;

    do {
      if (nRxLengthFlag) {
        /* The data received is the header */
        nRxLengthFlag = 0;
        nRxLength = (((uint8_t)m_cdc_data_array[4] << 8) +
                        (uint8_t)m_cdc_data_array[5]) -
                    8;
        index = 8;
      } else {
        /* The data received is the payload, (packet Length - 8(header length))
         * bytes */
        nRxLengthFlag = 1;
        nRxLength = 8;
        index = 0;
      }

      /*Get amount of data transferred*/
      static size_t size;
      static size_t loop_retry = 0;
      static size_t read_err = 0;
      size = app_usbd_cdc_acm_rx_size(p_cdc_acm);
      NRF_LOG_DEBUG(
          "RX: size: %lu char: %c", size, m_cdc_data_array[index - 1]);

      eOsStatus =
          adi_osal_MutexPend(g_usb_transfer_lock, ADI_OSAL_TIMEOUT_FOREVER);
      if (eOsStatus != ADI_OSAL_SUCCESS) {
        Debug_Handler();
      }
      /* Fetch data until internal buffer is empty,submit buffer for next read
       */
      ret = app_usbd_cdc_acm_read(
          &m_app_cdc_acm, &m_cdc_data_array[index], nRxLength);
      if (ret == NRF_SUCCESS) {
      } else {
        loop_retry++;
        read_err = ret;
      }
      eOsStatus = adi_osal_MutexPost(g_usb_transfer_lock);
      if (eOsStatus != ADI_OSAL_SUCCESS) {
        Debug_Handler();
      }
      UNUSED_PARAMETER(size);
      UNUSED_PARAMETER(read_err);
    } while (ret == NRF_SUCCESS);

    if (nRxLengthFlag) {
#if 0
                ADI_OSAL_STATUS osal_result;
                osal_result = adi_osal_MsgQueuePost(gh_usbd_rx_task_msg_queue,m_cdc_data_array);
                if (osal_result != ADI_OSAL_SUCCESS)
                  Debug_Handler();
#endif
      uint32_t data_len;
      m2m2_hdr_t *p_m2m2_ = NULL;
      ADI_OSAL_STATUS err;

      gp_pkt_hdr = (m2m2_hdr_t *)m_cdc_data_array;
      data_len = BYTE_SWAP_16(gp_pkt_hdr->length);

      p_m2m2_ = post_office_create_msg(data_len);
      if (p_m2m2_ == NULL) {
        // continue;
      }
      memcpy((uint8_t *)p_m2m2_, m_cdc_data_array, data_len);

      /* swap from network byte order to little endian */
      p_m2m2_->src = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(p_m2m2_->src);
      p_m2m2_->dest = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(p_m2m2_->dest);
      p_m2m2_->length = BYTE_SWAP_16(p_m2m2_->length);
      p_m2m2_->checksum = BYTE_SWAP_16(p_m2m2_->checksum);
#ifdef COLLISION_DEBUG
      if ((p_m2m2_->dest == M2M2_ADDR_SYS_PM) && (p_m2m2_->length == 14))
        gPingReqCnt++;
#endif // COLLISION_DEBUG
      post_office_send(p_m2m2_, &err);
    }
#endif // Use app_usbd_cdc_acm_read API
#ifdef USE_USB_READ_ANY
    ret_code_t ret;
#if 0
            ADI_OSAL_STATUS osal_result;
            osal_result = adi_osal_MsgQueuePost(gh_usbd_rx_task_msg_queue,m_cdc_data_array);
            if (osal_result != ADI_OSAL_SUCCESS)
              Debug_Handler();
#endif
            /*Get amount of data transferred*/
            static size_t size=0;
            size += app_usbd_cdc_acm_rx_size(p_cdc_acm);
            NRF_LOG_INFO("RX: size: %lu char: %s", size, m_cdc_data_array);

            if(pkt_complete)
            {
               gp_pkt_hdr = (m2m2_hdr_t *)m_cdc_data_array;
               pkt_len = BYTE_SWAP_16(gp_pkt_hdr->length);
               if(pkt_len>BLE_NUS_MAX_DATA_LEN)
               {
                 NRF_LOG_INFO("USB RX: received incorrect pkt");
                 pkt_len=0;//reset
                 pkt_complete=1;//reset
                 size=0;
                 return;
               }
               //ASSERT(pkt_len<=BLE_NUS_MAX_DATA_LEN);
            }

            if(pkt_len==size)
            {
              pkt_complete=1;
              size=0;

              m2m2_hdr_t *p_m2m2_ = NULL;
              ADI_OSAL_STATUS       err;

              p_m2m2_ = post_office_create_msg(pkt_len);
              if (p_m2m2_ == NULL) {
                //continue;
                break;
              }
              memcpy((uint8_t *)p_m2m2_, m_cdc_data_array, pkt_len);

              /* swap from network byte order to little endian */
              p_m2m2_->src = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(p_m2m2_->src);
              p_m2m2_->dest = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(p_m2m2_->dest);
              p_m2m2_->length = BYTE_SWAP_16(p_m2m2_->length);
              p_m2m2_->checksum = BYTE_SWAP_16(p_m2m2_->checksum);
              if(M2M2_ADDR_UNDEFINED == usb_pkt_src)
                  usb_pkt_src = p_m2m2_->src;
            /* send to po for proper routing */
            post_office_send(p_m2m2_, &err);
            }
            else
              pkt_complete=0;

    do {

      static size_t loop_retry = 0;
      static size_t read_err = 0;

      eOsStatus =
          adi_osal_MutexPend(g_usb_transfer_lock, ADI_OSAL_TIMEOUT_FOREVER);
      if (eOsStatus != ADI_OSAL_SUCCESS) {
        Debug_Handler();
      }
      ret = app_usbd_cdc_acm_read_any(
          &m_app_cdc_acm, (m_cdc_data_array + size), BLE_NUS_MAX_DATA_LEN);
      eOsStatus = adi_osal_MutexPost(g_usb_transfer_lock);
      if (eOsStatus != ADI_OSAL_SUCCESS) {
        Debug_Handler();
      }
      if (ret == NRF_SUCCESS) {
      } else {
        loop_retry++;
        read_err = ret;
      }
      UNUSED_PARAMETER(size);
      UNUSED_PARAMETER(read_err);
    } while (ret == NRF_SUCCESS);
#if 0
            uint32_t  data_len;
            m2m2_hdr_t *p_m2m2_ = NULL;
            ADI_OSAL_STATUS       err;

