ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/usbd_task.c
            gp_pkt_hdr = (m2m2_hdr_t *)m_cdc_data_array;
            data_len = BYTE_SWAP_16(gp_pkt_hdr->length);

            p_m2m2_ = post_office_create_msg(data_len);
            if (p_m2m2_ == NULL) {
              //continue;
            }
            memcpy((uint8_t *)p_m2m2_, m_cdc_data_array, data_len);

            /* swap from network byte order to little endian */
            p_m2m2_->src = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(p_m2m2_->src);
            p_m2m2_->dest = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(p_m2m2_->dest);
            p_m2m2_->length = BYTE_SWAP_16(p_m2m2_->length);
            p_m2m2_->checksum = BYTE_SWAP_16(p_m2m2_->checksum);
#ifdef COLLISION_DEBUG
            if((p_m2m2_->dest == M2M2_ADDR_SYS_PM) && (p_m2m2_->length == 14))
                gPingReqCnt++;
#endif // COLLISION_DEBUG
            post_office_send(p_m2m2_, &err);

            do {
                /*Get amount of data transferred*/
                static size_t size;
                static size_t  loop_retry=0;
                static size_t  read_err=0;
                size = app_usbd_cdc_acm_rx_size(p_cdc_acm);
                NRF_LOG_DEBUG("RX: size: %lu char: %s", size, m_cdc_data_array);
                eOsStatus = adi_osal_MutexPend(g_usb_transfer_lock, ADI_OSAL_TIMEOUT_FOREVER);
                if (eOsStatus != ADI_OSAL_SUCCESS) {
                    Debug_Handler();
                }
                ret = app_usbd_cdc_acm_read_any(&m_app_cdc_acm, (m_cdc_data_array), BLE_NUS_MAX_DATA_LEN);
                eOsStatus = adi_osal_MutexPost(g_usb_transfer_lock);
                if (eOsStatus != ADI_OSAL_SUCCESS) {
                    Debug_Handler();
                }
                if (ret == NRF_SUCCESS)
                  {
                  }
                  else {
                   loop_retry++;
                   read_err = ret;
                  }
                UNUSED_PARAMETER(size);
                UNUSED_PARAMETER(read_err);
            }
            while (ret == NRF_SUCCESS);
#endif // Use app_usbd_cdc_acm_read_any API
#endif
    break;
  }

  default:
    break;
  }
}


bool get_usb_powered_event_status()
{
  return(g_usb_power_detected_flag);
}

void reset_usb_powered_event_status()
{
  g_usb_power_detected_flag = false;
}

/*!
 ****************************************************************************
 * @brief User event handler for USBD application task
 ******************************************************************************/
static void usbd_user_ev_handler(app_usbd_event_type_t event) {
  switch (event) {
  case APP_USBD_EVT_DRV_SUSPEND:
    break;

  case APP_USBD_EVT_DRV_RESUME:
    break;

  case APP_USBD_EVT_STARTED:
    break;

  case APP_USBD_EVT_STOPPED:
    app_usbd_disable();
    break;

  case APP_USBD_EVT_POWER_DETECTED: {
    // usb_pwm_reset_init();
    NRF_LOG_INFO("USB power detected");

    if (!nrf_drv_usbd_is_enabled()) {
      app_usbd_enable();
    }
    gb_usb_status = USB_CONNECTED;
#ifdef LOW_TOUCH_FEATURE
#ifdef ENABLE_WATCH_DISPLAY
    /* Added gLowTouchRunning flag checking, in the below condition, to check
       when to give the StopLog sequence.
       Without this, if the USB cable is plugged in fast enough,(before LT logging actually starts),
       then the Stop Cmds would be missed to be send and the rest of the flags gets cleared.
    */
    if(get_low_touch_trigger_mode2_status() && get_lt_mode2_selection_status()
       && gLowTouchRunning)
    {
        reset_lt_mode2_selection_status();    /*reset the LT mode2 log selection status*/
        g_usb_power_detected_flag = true;
        adi_osal_SemPost(lt_task_evt_sem);
    }
#endif
#endif//LOW_TOUCH_FEATURE
  } break;

  case APP_USBD_EVT_POWER_REMOVED: {
    // usb_pwm_reset_uninit();
    NRF_LOG_INFO("USB power removed");
#ifdef HIBERNATE_MD_EN
    hibernate_md_set(HIB_MD_USB_DISCONNECT_EVT);
    hibernate_mode_entry();
#endif
#ifdef CUST4_SM
    /**
    * Register the event received
    * Find out USB unintentional disconnection: check if previously it was USB_PORT_OPENED
    */
    if(gb_usb_status == USB_PORT_OPENED)
    {
      set_user0_config_app_event(EVENT_USB_DISCONNECT_UNEXPECTED);
    }
#endif
    gb_usb_status = USB_DISCONNECTED;
    gb_force_stream_stop = true;
    app_usbd_stop();
    adi_osal_SemPost(g_usbd_tx_task_evt_sem);
  } break;

  case APP_USBD_EVT_POWER_READY: {
    NRF_LOG_INFO("USB ready");
#ifdef HIBERNATE_MD_EN
    hibernate_md_clear(HIB_MD_USB_DISCONNECT_EVT);
    hibernate_mode_entry();
#endif
    gb_usb_status = USB_CONNECTED;
    gb_force_stream_stop = false;
    app_usbd_start();
  } break;

  default:
    break;
  }
}

/*!
 ****************************************************************************
 * @brief Event handler for USBD application task ISR events
 ******************************************************************************/
void usb_new_event_isr_handler(
    app_usbd_internal_evt_t const *const p_event, bool queued) {
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  UNUSED_PARAMETER(p_event);
  UNUSED_PARAMETER(queued);
  ASSERT(gh_usbd_app_task_handler != NULL);
  /* Release the semaphore */
  vTaskNotifyGiveFromISR(
      (TaskHandle_t)gh_usbd_app_task_handler, &xHigherPriorityTaskWoken);
  portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

/*!
 ****************************************************************************
 * @brief  USBD application task - handle usbd application events -user and isr
 * events
 * @param  pArgument not used
 * @return None
 ******************************************************************************/
static void usbd_application_task(void *pArgument) {
  ret_code_t ret;

  static const app_usbd_config_t usbd_config = {
      .ev_isr_handler = usb_new_event_isr_handler,
      .ev_state_proc = usbd_user_ev_handler};
  UNUSED_PARAMETER(pArgument);

  ret = app_usbd_init(&usbd_config);
  APP_ERROR_CHECK(ret);
  app_usbd_class_inst_t const *class_cdc_acm =
      app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
  ret = app_usbd_class_append(class_cdc_acm);
  APP_ERROR_CHECK(ret);
  ret = app_usbd_power_events_enable();
  APP_ERROR_CHECK(ret);

  /* Set the first event to make sure that USB queue is processed after it is
   started */
  UNUSED_RETURN_VALUE(xTaskNotifyGive(xTaskGetCurrentTaskHandle()));
  /* Enter main loop. */
  for (;;) {
    /* Waiting for event */
    UNUSED_RETURN_VALUE(ulTaskNotifyTake(pdTRUE, USB_THREAD_MAX_BLOCK_TIME));
    while (app_usbd_event_queue_process()) {
      /* Nothing to do */
    }
  }
}

/*@}*/  /* end of group Application_Task */
/**@}*/ /* end of group Tasks */
